title: mpvue转app研究
date: 2018/8/17
categories:
- 小程序
---

### 调研问题：
1. mpvue 转 app 实现方式
2. 可能遇到的难点或复杂点

### 结果：
#### 基本放弃 mpvue 直接转 app ,采用 [uniapp](http://uniapp.dcloud.io/) 更合适，原因：
1. [mpvue官方文档](http://mpvue.com/)，对于一份代码跑三端的实现归结为理想状态，目前并未实现，只有一句话可供参考，网上也几乎找不到基于 mpvue 实现的移动端 app 案例，可实现转 h5，但需要一套新的 build 规则需要趟坑。
2. [uni-app](http://uniapp.dcloud.io/) 相比之下文档齐全, 同时支持小程序全套 api，以及组件。支持一键打包，可以跑在小程序、安卓、ios。

#### 可能遇到的难点或复杂点
1. mpvue 转 unapp 十分方便，清除之前的 `main.js` 文件， 全局替换 `wx. 转为 uni.`、
`/main 转为 /index`、在 pages.json中添加路由，即可
2. 对于之前的分模块打包方式在这里沿用的可能性不大，实现分模块建议各个项目使用不同的 pages.json

#### 迁移测试总结：迁移了整体架子和立案模块
1. 小程序测试使用效果与原小程序并无差别
2. 在安卓上app测试，调用文件系统时会有些迟钝，页面间跳转以及其他操作基本流畅
3. ios使用页面间切换流畅

#### 使用 uni-app 风险点：
1. uni-app对小程序的打包借鉴了 mpvue, 使用的 build 大同小异，但更加复杂，如果遇到需要拆分 vendor 的情况需要重新研究。目前 uni-app 在打包时自行对 vendor 进行了压缩，所以需要拆分 vendor 的可能性比较小
2. uni-app 的打包规则 build 文件不是放在项目代码中的，而是在 HBuilder 编辑器中，如果修改了打包规则，团队开发需要使用定制版的编辑器，或者将打包从编辑器中拆分出来，也是可行的。
3. uni-app 的打包成 app 基于云服务，无法本地控制。
